src/test/tsung/kfs-docsearch-base.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/opt/local/share/tsung/tsung-1.0.dtd">
<tsung version="1.0" dumptraffic="true" loglevel="notice">
  <clients>
    <client use_controller_vm="true" host="localhost"/>
  </clients>
  <servers>
    <server port="80" type="tcp" host="tst.kfs.uconn.edu"/>
  </servers>
  <load>
    <arrivalphase phase="1" duration="1" unit="minute">
      <users maxnumber="1" interarrival="1" unit="second"/>
    </arrivalphase>
  </load>
  <options>
    <option name="user_agent" type="ts_http">
      <user_agent probability="100">
        Mozilla/5.0 (Macintosh; Intel Mac OS X 10.7; rv:8.0.1) Gecko/20100101 Firefox/8.0.1
      </user_agent>
    </option>
    <option name="file_server" value="/home/ltuser/Open-Performance-Automation-Framework/config/import/kfs/users.csv" id="users"/>
  </options>
  <sessions>
    <session name="stress" probability="100" type="ts_http">
      <transaction name="docsearch">
        <request subst="false">
          <dyn_variable name="redir" re="Location: (.*)" />
          <http version="1.1" url="http://tst.kfs.uconn.edu/kfs-dev/portal.do" method="GET"/>
        </request>
        <request subst="true">
          <dyn_variable name="lt" xpath="//input[@name='lt']/@value"/>
          <dyn_variable name="execution" xpath="//input[@name='execution']/@value"/>
          <http version="1.1" url="%%_redir%%" method="GET"/>
        </request>
        <request subst="true">
          <dyn_variable name="ticket" re="Location: .*ticket=(.*)" />
          <http version="1.1" content_type="application/x-www-form-urlencoded" contents="lt=%%_lt%%&amp;execution=%%_execution%%&amp;username=lep12004&amp;password=Entr0py0&amp;_eventId=submit" url="https://login.uconn.edu/cas/login?service=http%3A%2F%2Ftst.kfs.uconn.edu%2Fkfs-dev%2Fportal.do" method="POST"/>
        </request>
        <request subst="true">
          <dyn_variable name="redir" re="Location: (.*)" />
          <http version="1.1" url="http://tst.kfs.uconn.edu/kfs-dev/portal.do?ticket=%%_ticket%%" method="GET"/>
        </request>
        <request subst="true">
          <http version="1.1" url="%%_redir%%" method="GET"/>
        </request>

        <request><http url='/kfs-dev/backdoorlogin.do' version='1.1'  contents='backdoorId=btp98001&amp;imageField=Login&amp;methodToCall=login' content_type='application/x-www-form-urlencoded' method='POST'></http></request>
        <request><http url='/kfs-dev/index.jsp' version='1.1' method='GET'></http></request>
        <request><http url='/kfs-dev/portal.jsp' version='1.1' method='GET'></http></request>

        <request><http version="1.1" url="/kfs-dev/kr/lookup.do?methodToCall=search&amp;businessObjectClassName=org.kuali.rice.kew.docsearch.DocSearchCriteriaDTO&amp;docFormKey=88888888&amp;returnLocation=http://trn.kfs.uconn.edu/kfs-dev/portal.do&amp;hideReturnLink=true&amp;backdoorId=btp98001&amp;fromDateCreated=01/26/2011" method="GET"/></request>
      </transaction>
    </session>
  </sessions>
</tsung>