src/test/tsung/kfs-dv-base.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/opt/local/share/tsung/tsung-1.0.dtd">
<tsung version="1.0" dumptraffic="true" loglevel="notice">
  <clients>
    <client use_controller_vm="true" host="localhost"/>
  </clients>
  <servers>
    <server port="80" type="tcp" host="tst.kfs.uconn.edu"/>
  </servers>
  <load>
    <arrivalphase phase="1" duration="5" unit="minute">
      <users maxnumber="1" interarrival="1" unit="second"/>
    </arrivalphase>
  </load>
  <options>
    <option name="user_agent" type="ts_http">
      <user_agent probability="100">
        Mozilla/5.0 (Macintosh; Intel Mac OS X 10.7; rv:8.0.1) Gecko/20100101 Firefox/8.0.1
      </user_agent>
    </option>
  </options>
  <sessions>
    <session name="test" probability="100" type="ts_http">
    </session>
  </sessions>
</tsung>